use db_lab3;

insert into `支行` values ('云银行中科大支行', 300000);

INSERT INTO `客户` VALUES (372301200000000000,'于子健',19912345678,'安徽省合肥市中国科学技术大学中校区','于子健',18887654321,'name@example.com','本人'),(372301200000000001,'张三',19912345678,'安徽省合肥市中国科学技术大学中校区','张三',18887654321,'name@example.com','本人'),(372301200000000002,'李四',19912345679,'安徽省合肥市中国科学技术大学中校区','李四',18887654321,'name@example.com','本人'),(372301200000000003,'王五',19912345678,'安徽省合肥市中国科学技术大学中校区','王五',18887654321,'name@example.com','本人'),(372301200000000004,'马六',19912345678,'安徽省合肥市中国科学技术大学中校区','马六',18887654321,'name@example.com','本人');

insert into `账户` values (0001, '云银行中科大支行', 1000, CURDATE(), '372301200000000000', CURDATE());
insert into `储蓄账户` values (0001, 0.025, '人民币');
insert into `客户在银行的账户` values ('云银行中科大支行', '372301200000000000', TRUE);

insert into `账户` values (0002, '云银行中科大支行', 0, CURDATE(), '372301200000000000', CURDATE());
insert into `支票账户` values (0002, 20000);
insert into `客户在银行的账户` values ('云银行中科大支行', '372301200000000000', FALSE);

select * from `客户`;